'''
2.2:函数声明
首先,函数声明以关键字def开始,接着为函数名,在往后为参数.
参数放在小括号中.多个参数之间用逗号隔开.

其次,函数没有定义返回的数据类型.Python不需要指定返回的数据类型.
甚至不需要指定是否有返回值.
实际上,每个Python函数都返回一个值.
如果函数执行过reture语句,它将返回指定的值,否则将返回None.

Python vs Java 的返回值.

在Java, C++和其他静态类型语言中,必须要指定函数返回值和
每个函数参数的数据类型.在Python中,永远也不需要明确指定任何的数据类型.
Python会根据赋给它的值在内部将其数据类型记录下来.

扩展:语言类型的比较
静态类型语言:
	一种在编译期间就确定数据类型的语言.大多数静态类型语言是通过
	要求在使用任一变量之前声明其数据类型来保证这一点的.
动态类型语言:
	一种在运行期才去确定数据类型的语言,与静态类型相反.它们确定一个变量
	的类型是在第一次给它赋值的时候.

强类型语言:
	一种总是强制类型定义的语言.Java和Python是强制类型定义的.
	您有一个整数,如果不明确地进行转换,不能将它当成一个字符串.

弱类型语言:
	一种类型可以被忽略的语言.与强类型相反.可以将整数123当成字符串"123"
	来使用,这期间不需要任何的显示转换.
'''





